--※実施順番は上から下まで順番に実施するようお願いいたします。

--調査区分：米以外
--変更内容：農業薬剤費「その他」項目の取得先位置更新
UPDATE 中間集計表項目マスタ
SET 行位置 = 113
WHERE 項目番号 = 'Q03030206'
AND バージョン区分 = 2
AND 登録削除区分 =  1
AND 調査区分 IN (4,5,6,7,8,9,10,11,12,13,14,16,17)
AND シート名 = '前年対比（支出）'

--調査区分：二条大麦
--変更内容：生産物販売状況項目取得先シート名修正
UPDATE 中間集計表項目マスタ
SET シート名 = '入力用（収入）'
WHERE バージョン区分 = 2
AND 登録削除区分 =1
AND 調査区分 =5
AND 項目番号 in ('Q02020102','Q02020202','Q02020302','Q02020104','Q02020204','Q02020304','Q02020106','Q02020206','Q02020306')

--調査区分：てんさい、さとうきび
--変更内容：取引糖度項目取得先シート名修正
UPDATE 中間集計表項目マスタ
SET シート名 = '入力用（収入）'
WHERE バージョン区分 = 2
AND 登録削除区分 =1
AND 調査区分 in (13,14)
AND 項目番号 in ('Q02010402')

--調査区分：小麦、二条大麦、六条大麦、はだか麦、そば、大豆、原料用かんしょ、原料用ばれいしょ、なたね、てんさい、さとうきび、小麦（組織）大豆（組織）
--変更内容：土壌改良資材項目追加
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 4, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q03020208', 0, 1, '前年対比（支出）', 20, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q03020308', 0, 1, '前年対比（支出）', 20, 30, NULL, NULL, 'kg', '2025-10-03 00:00:00.000', 'TestUser')