--調査区分：米以外
--変更内容：乾燥調製料の行位置、列位置更新
UPDATE 中間集計表項目マスタ
SET 行位置 = CASE 項目番号
                WHEN 'Q03060110' THEN 162
                WHEN 'Q03060210' THEN 163
             END,
    列位置 = 65
WHERE 調査区分 IN (4,5,6,7,8,9,12,16,17)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03060110', 'Q03060210');


--調査区分：米（個別）（組織法人）
--変更内容：乾燥調製料項目追加
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 3, 'Q03060151', 0, 1, '前年対比（支出）', 161, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 3, 'Q03060251', 0, 1, '前年対比（支出）', 161, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 3, 'Q03060351', 0, 1, '前年対比（支出）', 161, 31, NULL, NULL, 100, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 15, 'Q03060151', 0, 1, '前年対比（支出）', 161, 30, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 15, 'Q03060251', 0, 1, '前年対比（支出）', 161, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 15, 'Q03060351', 0, 1, '前年対比（支出）', 161, 31, NULL, NULL, 100, '2025-10-03 00:00:00.000', 'TestUser')