--調査区分：牛乳、子牛、育成牛・肥育牛
--変更内容：自給飼料一部データ削除
DELETE FROM 中間集計表項目マスタ 
WHERE 調査区分 IN (18,19,20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 明細番号 = 2
  AND 項目番号 IN ('Q03021401','Q03021501','Q03021601','Q03021701','Q03022801','Q03022901','Q03023001');

--調査区分：肥育豚
--変更内容：その他の資材と単価の一部データ削除
DELETE FROM 中間集計表項目マスタ 
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 明細番号 = 2
  AND 項目番号 IN ('Q03080103','Q03080203','Q03080303','Q03080503','Q03080701','Q03080801');

----------------------------------------------------------------------------------------------

--調査区分：牛乳、子牛、育成牛、肥育牛
--変更内容：自給飼料更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    ラウンド桁数 =
        CASE 項目番号
            WHEN 'Q03021701' THEN 1
            WHEN 'Q03021701' THEN 1
            WHEN 'Q03023001' THEN 1
        END,
    追加項目 = 
        CASE 項目番号
            WHEN 'Q03022801' THEN 2
            WHEN 'Q03022901' THEN 1
            ELSE NULL
        END    
WHERE 調査区分 IN (18,19,20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03021401','Q03021501','Q03021601','Q03021701','Q03022801','Q03022901','Q03023001');

--調査区分：肥育豚
--変更内容：自給飼料更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03020101','Q03020201','Q03020301','Q03020401');

----------------------------------------------------------------------------------------------

--調査区分：調査区分：牛乳、子牛
--変更内容：自給敷料費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (18,19)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03040601','Q03040701','Q03040801','Q03040901');

--調査区分：育成牛・肥育牛
--変更内容：自給敷料費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03030601','Q03030701','Q03030801','Q03030901');

--調査区分：肥育豚
--変更内容：自給敷料費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03040601','Q03040701','Q03040801','Q03040901');

----------------------------------------------------------------------------------------------

--調査区分：牛乳、子牛
--変更内容：自給光熱動力費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (18,19)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03050401','Q03050501','Q03050601','Q03050701','Q03050801');

--調査区分：育成牛・肥育牛
--変更内容：自給光熱動力費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03040401','Q03040501','Q03040601','Q03040701','Q03040801');


--調査区分：肥育豚
--変更内容：自給光熱動力費　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03050301','Q03050401','Q03050501','Q03050601');
----------------------------------------------------------------------------------------------

--調査区分：牛乳、子牛
--変更内容：その他の資材費（自給）　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL,
    ラウンド桁数 =
        CASE 項目番号
            WHEN 'Q03090503' THEN 2
            WHEN 'Q03090603' THEN 2
        END
WHERE 調査区分 IN (18,19)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03090103','Q03090203','Q03090303','Q03090503','Q03090603');

--調査区分：育成牛・肥育牛
--変更内容：その他の資材費（自給）　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL,
    ラウンド桁数 =
        CASE 項目番号
            WHEN 'Q03080503' THEN 2
            WHEN 'Q03080603' THEN 2
        END
WHERE 調査区分 IN (20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03080103','Q03080203','Q03080303','Q03080503','Q03080603');

--調査区分：肥育豚
--変更内容：その他の資材費（自給）　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL,
    ラウンド桁数 =
        CASE 項目番号
            WHEN 'Q03080503' THEN 2
        END
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03080103','Q03080203','Q03080303','Q03080503');

----------------------------------------------------------------------------------------------

--調査区分：牛乳、子牛
--変更内容：敷料費自給単価、光熱費自給単価、その他の資材自給単価　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL
WHERE 調査区分 IN (18,19)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03041201','Q03051001','Q03090801');


--調査区分：育成牛・肥育牛
--変更内容：敷料費自給単価、光熱費自給単価、その他の資材自給単価　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL,
    追加項目 = NULL
WHERE 調査区分 IN (20,21,22,23,24)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03031201','Q03041001','Q03080801');

--調査区分：肥育豚
--変更内容：自給飼料単価、,敷料費自給単価、光熱費自給単価、その他の資材自給コードと単価　更新
UPDATE 中間集計表項目マスタ 
SET 
    シート名 = '入力用（支出）',
    列位置 = NULL,
    行位置 = NULL
WHERE 調査区分 IN (25)
  AND バージョン区分 = 2
  AND 登録削除区分 = 1
  AND 項目番号 IN ('Q03020501','Q03041201','Q03050801','Q03080701','Q03080801');

----------------------------------------------------------------------------------------------

--調査区分：牛乳、子牛、育成牛・肥育牛、肥育豚
--長期短期支払利子項目追加
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 18, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010502', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 2, NULL, '2025-10-03 00:00:00.000', 'TestUser');


--調査区分：牛乳、子牛、育成牛・肥育牛、肥育豚
--長期短期支払利子項目追加（可変削除用）
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 18, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 18, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 19, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 20, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 21, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 22, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 23, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 24, 'Q06010502', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 25, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser');

----------------------------------------------------------------------------------------------

--調査区分：農産物(米以外)
--変更内容：買掛未払金項目追加
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 4, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010304', 0, 1, '前年対比（支出）', 222, 31, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010404', 0, 1, '前年対比（支出）', 222, 31, NULL, NULL, '100', '2025-10-03 00:00:00.000', 'TestUser');

--調査区分：農産物(米以外)
--変更内容：長期短期支払利子項目追加
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 4, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010102', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010302', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010402', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010103', 1, 1, '入力用（支出）', NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010303', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010403', 1, 1, '入力用（支出）', NULL, NULL, NULL, 1, NULL, '2025-10-03 00:00:00.000', 'TestUser');

--調査区分：農産物(米以外)
--変更内容：長期短期支払利子項目追加（可変削除用）
INSERT INTO 中間集計表項目マスタ
(バージョン区分, 調査区分, 項目番号, 明細番号, 登録削除区分, シート名, 行位置, 列位置, 乗算値, ラウンド桁数,追加項目,更新日付,更新者ID)
VALUES
(2, 4, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 4, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 5, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 6, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 7, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 8, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 9, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 10, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 11, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 12, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 13, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 14, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 16, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010102', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010302', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010402', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010103', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010303', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser'),
(2, 17, 'Q06010403', 0, 2, NULL, NULL, NULL, NULL, NULL, NULL, '2025-10-03 00:00:00.000', 'TestUser');

